БылковД.А_70180166/src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаПересдачу</name>
  <basedOn>Document.ИдентификацияАкадемическихЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ИдентификацияАкадемическихЗадолженностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/InformationRegisters/ДатыПересдач/ДатыПересдач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыПересдач</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БылковД.А_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>CatalogRef.СтуденческиеБилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковД.А_70180166/src/Documents/НаправлениеНаПересдачу/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИдентификацияАкадемическихЗадолженностей") Тогда
    
        ЭтотОбъект.Группа = ДанныеЗаполнения.Группа;
        ЭтотОбъект.ЛичныйИндекс = ДанныеЗаполнения.ЛичныйИндекс;
        ЭтотОбъект.НаправленияПодготовки = ДанныеЗаполнения.НаправленияПодготовки;
        ЭтотОбъект.Студент = ДанныеЗаполнения.Студент;
        ЭтотОбъект.Факультет = ДанныеЗаполнения.Факультет;
        ЭтотОбъект.ФормаОбучения = ДанныеЗаполнения.ФормаОбучения;
        ЭтотОбъект.Основание = ДанныеЗаполнения.Ссылка;
        ЭтотОбъект.Курс = ПолучитьКурсСтудента(ДанныеЗаполнения.Студент);
        
		
		ДокументОснование = ДанныеЗаполнения.ПолучитьОбъект();
                
		
		Если ДокументОснование.Характеристика.Количество() > 0 Тогда
			
			ПерваяСтрока = ДокументОснование.Характеристика[0];
            ЭтотОбъект.Дисциплина = ПерваяСтрока.Дисциплины;
            ЭтотОбъект.НаименованиеКонтроля = ПерваяСтрока.НаименованиеКонтроля;
            
			
			Если Метаданные.Документы[ЭтотОбъект.Метаданные().Имя].ТабличныеЧасти.Найти("Характеристика") <> Неопределено Тогда
                ЭтотОбъект.Характеристика.Очистить();
                НоваяСтрока = ЭтотОбъект.Характеристика.Добавить();
                НоваяСтрока.Дисциплины = ПерваяСтрока.Дисциплины;
                НоваяСтрока.НаименованиеКонтроля = ПерваяСтрока.НаименованиеКонтроля;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры   

&НаСервере
Функция ПолучитьКурсСтудента(СсылкаНаСтудента) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Курс КАК Курс
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Курс;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДатыПересдач.Записывать = Истина;
	Движение = Движения.ДатыПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = Дата;
	Движение.ДатаПересдачи = ДатаПроведения;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
